{"data":{"title":"2017年710随笔 于嘉兴-福州列车","slug":"2018年710随笔-于嘉兴-福州列车","description":"","date":"2017-07-09T19:16:00.000Z","updated":"2025-05-20T11:46:57.000Z","language":"zh-CN","comments":true,"url":"2017/07/10/2018年710随笔-于嘉兴-福州列车/","cover":null,"images":[],"content":"<p>此刻正在前往福州的火车上，在长达十五个小时的绿皮车时间里，真的让人很难受。想睡觉，可是又不能好好地睡，现在很累很困，却睡不着，所以在这漫长的夜里面陷入深深地思考。</p>\n<p>站在窗前，看到窗外的风景变幻多端，偶尔点点灯光、偶尔路灯透亮、偶尔通过窗户看到的只是自己的面孔。看着玻璃里面阴影的自己，头前已经有一两根白头发了，索性拔掉，因为我觉得我还很年轻，这种东西与我无关。</p>\n<p>二十一年走过来了，想想多么的可怕，二十一年了呀！这是一个多么吓人的时间。或许是长大了，对于一些实物关注的东西也不一样了，二十一年父母也从一两根白头发过度到了半头白发，貌似就只是发生在这几年，父母老的速度感觉已经比之前更快了。现在每次再见到父母，再也没有以前那种憧憬与期盼了，更多的是对他们的心疼与内心的愧疚。</p>\n<p>还有一年多就要出去工作了，既憧憬，又彷徨。憧憬的是能够走出学校了，能自己挣钱了，自己挣的钱再怎么花也没有像现在这样心疼，或许可以做更多以前因为没有足够的钱可以做到的事，只是怕再也没有以前那样的心；彷徨于自己要像个大人一样活着了，有些事再也不会因为你是小孩，因为你是学生而同情你可怜你；彷徨于要为自己的以后的人生想办法了，面对工作、对象、父母，又该如果去处理这些问题呢？</p>\n<p>工作，用兴趣去劳动。如何选择？喜欢编程这个东西，因为当看到自己一行行写出来的代码转化为想要的效果的时候，是一种多么有成就感的事情。用代码去解决一些问题，也是一种乐事。可是…难道要敲一辈子代码么？难道要给别人打一辈子的工么？</p>\n<p>对象，以后要陪一辈子的人。何去寻觅？她可以什么都不做，但是他能在我最苦闷的时候来安慰我；能在我得意的时候，和我一起分享；不管我有多穷，而不会看不起我不管我我做什么事，她都能支持；不管发生什么，她都能陪在我身边。这样的女人，我宁愿累死也愿意会为她努力。<br>一个人，一辈子。炊烟起了，我在门口等你；夕阳下了，我在山边等你；叶子黄了，我在树下等你；月儿弯了，我在十五等你；细雨来了，我在伞下等你；流水冻了，我在河畔等你；生命累了，我在天堂等你；我们老了，我在来生等你。无论如何我和她，她和我都能够一直在一起。</p>\n<p>父母，一直支持我们的人。如何回报？或许一个好一点的工作，不错的对象，是对他们最大的回报。父母最大的期盼就是希望子女能够过得好，拼命地去挣钱，可却苦了自己。处处节约，只希望子女能过得好。对于我们，他们付出太多了。也许他们经常说我们这不行那不行，可是心里却很是因为我们而自豪。</p>\n<p>此刻好冷，一件T恤加衬衫伴随一条阳光牛仔小短裤完全抵挡不住半夜这咄咄逼人的寒气，让人冷得发抖，可却并没有多余的衣服了，只能默默地扛着。生活，不也如此么？<br>回家的火车因为天气原因而晚点了，在听到这则通知时，你也只能发一下牢骚，也只能去默默接受这个事实；心爱的球队这场比赛输了，在终场哨声响起时，你也只能作几声叹息，也只能去默默接受这个结果。期待已久的电影让你失望了，在荧幕开始呈现演员表的时候，你也只能扫兴而归，也只能默默接受这样的一个故事情节。</p>\n<p>有些事情无法被我们所改变，但唯一可以改变的是心态。心态好，或许可以让一个人活得并不那么累。<br>回家的火车因为天气而晚点了，我们或许可以这样想：还好还好只是晚点一小时，并不是晚点两个小时；心爱的球队这场比赛输了，或许我们可以这样想：实力很对面差距本来就很大的，不过比分是0:1不是0:3还是。能接受的；期待已久的电影让你失望了，或许我们可以这样想：和女朋友出来看电影的，能和她在一起这样一两个小时，我已经很开心了。</p>\n<p>想起那句烂大街的话：生活不止眼前的苟且，还有诗和远方的田野。放这里再适合不过了。能够：”宠辱不惊，看庭前花开花落；去留无意，望天上云卷云舒”的人，我想应该也过得很幸福。</p>\n<p>2017年07月10日 03:13</p>\n","raw":"title: 2017年710随笔 于嘉兴-福州列车\nauthor: 落叶挽歌\nthumbnail: 'https://cdn.pixabay.com/photo/2017/07/29/13/17/green-2551467_960_720.jpg'\ntags:\n  - 旅行\ncategories:\n  - 生活感想\ndate: 2017-07-10 03:16:00\n---\n此刻正在前往福州的火车上，在长达十五个小时的绿皮车时间里，真的让人很难受。想睡觉，可是又不能好好地睡，现在很累很困，却睡不着，所以在这漫长的夜里面陷入深深地思考。\n\n\n站在窗前，看到窗外的风景变幻多端，偶尔点点灯光、偶尔路灯透亮、偶尔通过窗户看到的只是自己的面孔。看着玻璃里面阴影的自己，头前已经有一两根白头发了，索性拔掉，因为我觉得我还很年轻，这种东西与我无关。\n\n\n二十一年走过来了，想想多么的可怕，二十一年了呀！这是一个多么吓人的时间。或许是长大了，对于一些实物关注的东西也不一样了，二十一年父母也从一两根白头发过度到了半头白发，貌似就只是发生在这几年，父母老的速度感觉已经比之前更快了。现在每次再见到父母，再也没有以前那种憧憬与期盼了，更多的是对他们的心疼与内心的愧疚。\n\n\n还有一年多就要出去工作了，既憧憬，又彷徨。憧憬的是能够走出学校了，能自己挣钱了，自己挣的钱再怎么花也没有像现在这样心疼，或许可以做更多以前因为没有足够的钱可以做到的事，只是怕再也没有以前那样的心；彷徨于自己要像个大人一样活着了，有些事再也不会因为你是小孩，因为你是学生而同情你可怜你；彷徨于要为自己的以后的人生想办法了，面对工作、对象、父母，又该如果去处理这些问题呢？\n\n\n工作，用兴趣去劳动。如何选择？喜欢编程这个东西，因为当看到自己一行行写出来的代码转化为想要的效果的时候，是一种多么有成就感的事情。用代码去解决一些问题，也是一种乐事。可是…难道要敲一辈子代码么？难道要给别人打一辈子的工么？\n\n\n对象，以后要陪一辈子的人。何去寻觅？她可以什么都不做，但是他能在我最苦闷的时候来安慰我；能在我得意的时候，和我一起分享；不管我有多穷，而不会看不起我不管我我做什么事，她都能支持；不管发生什么，她都能陪在我身边。这样的女人，我宁愿累死也愿意会为她努力。\n一个人，一辈子。炊烟起了，我在门口等你；夕阳下了，我在山边等你；叶子黄了，我在树下等你；月儿弯了，我在十五等你；细雨来了，我在伞下等你；流水冻了，我在河畔等你；生命累了，我在天堂等你；我们老了，我在来生等你。无论如何我和她，她和我都能够一直在一起。\n\n\n父母，一直支持我们的人。如何回报？或许一个好一点的工作，不错的对象，是对他们最大的回报。父母最大的期盼就是希望子女能够过得好，拼命地去挣钱，可却苦了自己。处处节约，只希望子女能过得好。对于我们，他们付出太多了。也许他们经常说我们这不行那不行，可是心里却很是因为我们而自豪。\n\n\n此刻好冷，一件T恤加衬衫伴随一条阳光牛仔小短裤完全抵挡不住半夜这咄咄逼人的寒气，让人冷得发抖，可却并没有多余的衣服了，只能默默地扛着。生活，不也如此么？\n回家的火车因为天气原因而晚点了，在听到这则通知时，你也只能发一下牢骚，也只能去默默接受这个事实；心爱的球队这场比赛输了，在终场哨声响起时，你也只能作几声叹息，也只能去默默接受这个结果。期待已久的电影让你失望了，在荧幕开始呈现演员表的时候，你也只能扫兴而归，也只能默默接受这样的一个故事情节。\n\n\n有些事情无法被我们所改变，但唯一可以改变的是心态。心态好，或许可以让一个人活得并不那么累。\n回家的火车因为天气而晚点了，我们或许可以这样想：还好还好只是晚点一小时，并不是晚点两个小时；心爱的球队这场比赛输了，或许我们可以这样想：实力很对面差距本来就很大的，不过比分是0:1不是0:3还是。能接受的；期待已久的电影让你失望了，或许我们可以这样想：和女朋友出来看电影的，能和她在一起这样一两个小时，我已经很开心了。\n\n\n想起那句烂大街的话：生活不止眼前的苟且，还有诗和远方的田野。放这里再适合不过了。能够：\"宠辱不惊，看庭前花开花落；去留无意，望天上云卷云舒\"的人，我想应该也过得很幸福。\n\n\n\n\n\n\n2017年07月10日 03:13","categories":[{"name":"生活感想","api":"api/categories/life.json"}],"tags":[{"name":"旅行","api":"api/tags/travel.json"}]},"api":"api/posts/2017/07/10/2018年710随笔-于嘉兴-福州列车.json"}