{"data":{"title":"写在我即将毕业旅行前","slug":"写在毕业之际旅行前","description":"","date":"2019-06-04T11:24:00.000Z","updated":"2025-05-20T11:46:57.000Z","language":"zh-CN","comments":true,"url":"2019/06/04/写在毕业之际旅行前/","cover":null,"images":[],"content":"<p>忙碌的一天，又要到下班的时候了，一天好似很忙，其实回过头来仔细想想，一天好像并没有做太多的事情，然而确实是这样子度过一天了，就像我们的青春岁月，看样子并没有经历什么，但它就这样匆匆过去了，亦忧伤，亦憧憬。</p>\n<p>还有两周就要回校参加毕业典礼了，向公司请了十天假，算上端午以及周末，大概有半个多月属于自己的日子吧，也算是大学最后一点还是以学生身份存在的时间了。早在几个月前我都在筹划这次出去游玩了，因为我想出去走走，想出去看看。纵观整个大学生涯，自己也算是去了不少地方了，屋子里车票、机票已经收纳了一沓了。看着每一张车票的起点与终点以及行程时间，还能想起那时候发生过的事，或许有些事还在记忆里面，或许可能存在我的日记里面，或许我什么也记不得了。</p>\n<p><strong>2015年8月15日 绵阳-上海：</strong>距离大学开学还有一个月了，父亲陪我度过了整个高三，待我拿到通知书后，我与父亲来到上海。父亲是一个节俭的人，买了绿皮车，将近两千多公里的路程，三十多个小时的行程，脚没有办法舒展开，时间长了别的难受。当看到那些没有座位的那些人要不停地给过路人让路的时候，我觉得自己也挺幸运的，至少我还有一个属于自己的位置，不需要为别人让路。在这煎熬的行程中，我并没有去抱怨，我只是一直在想，我以后一定要努力，一定不会让我和我父亲再受这样的遭遇。</p>\n<p><strong>2015年9月14日 上海-温州</strong>：马上就要大学开学了。离开了父母，将一个人去面对新的生活了，路过杭州的时候，车窗外一片开阔的平原，让我看到极具江南特色的景象：鳞次栉比的房屋伴着小河流，来来往往的车辆川流不息，很憧憬那样“小桥流水人家”的生活，这大概是对杭州的第一印象吧。</p>\n<p><strong>2016年1月22日 温州-成都：</strong>大学寒假第一次回家，运气很好，我和同学抢到了卧铺票，有了一个较舒服的乘车环境。与我通行的还有很多大学川籍同学，因此一路上也变得并不孤独，时而和他们“摆龙门阵”，累了就回床铺上面去休息一下，我记得我当时带了一本《浪潮之巅》。</p>\n<p><strong>2017年7月18日 温州-太原：</strong>第一次坐飞机，带着许多憧憬出发，但让人失望的是我错过了那一天的飞机，原本安排的好好的行程，一下子把我的计划打乱了。这时候我真的很迷茫，我不知道该去哪里，我也不知道该做什么，整个脑子是一片空白，在街上走走，最后回学校见到了精神支柱。然后去了太原平遥古城，喜欢太原老大爷那种街边悠然下着象棋的生活。</p>\n<p><strong>2017年7月10日 嘉兴-福州：</strong>又是一次暑假，我去嘉兴看望我爸，然后我爸他们提议去福州找我的大姑爷家玩，这一次我和我的父亲快吵了一架，因为我想让他买一张动车票，可父亲执着的只买绿皮车票，他觉得能节约钱，可是我觉得时间才是最重要的，那时候我没有一点收入，我说服不了他，绿皮车从晚上八点开到第二天早上八点，整个一晚我没有怎么睡，感慨太多，我也告诉我自己要努力。当时也写过一篇随笔：<a href=\"http://julis.wang/2017/07/10/2018%E5%B9%B4710%E9%9A%8F%E7%AC%94-%E4%BA%8E%E5%98%89%E5%85%B4-%E7%A6%8F%E5%B7%9E%E5%88%97%E8%BD%A6/\" title=\"2017年710随笔 于嘉兴-福州列车\">2017年710随笔 于嘉兴-福州列车</a></p>\n<p><strong>2017年9月02日 温州-杭州：</strong>这一次算是第一次以异地恋的身份去见了那时喜欢的人，一路忐忑。记得那时候带的是一本《小王子》，但是感觉没有看太懂，好像过了天真的年纪，已经看不太明白小王子的天真了。</p>\n<p><strong>2018年8月23日 杭州-太原：</strong> 或许真的是和太原有缘分，时隔一年再次去太原，这次我并没有错过，过了一年，变得成熟些了，这时候我已经在参加实习了。这次是代表整个学校唯一一只队伍进电子商务全国总决赛，压力与动力并存吧。</p>\n<p><strong>2019年2月14日 德阳-成都：</strong>这是最近一次从家出发去杭州在成都中转，在德阳站中因为高铁晚点，我遇到了一个女孩子，或许这是读大学以后认识的第一个非本大学的四川女孩子吧，或许是缘分，我和她是同一辆车，在德阳到成都只有短短半个小时的行车时间，居然车晚点将近两个小时，于是和她就聊啊、聊啊，从小学说到初中高中，从高中说到大学，再从大学说到实习。原来她也和我一样是大四的学生，原来我和她大学同学是初中高中同学，真的是缘分吧。第一次是多么的希望列车晚点的时间能够再长一点。只可惜，我本将心照明月，奈何明月照沟渠。</p>\n<p>……</p>\n<p><strong>2019年6月10日 杭州-青岛、烟台、威海、大连？</strong>  或许是在被公司同事的鼓励下：现在有时间多出去玩玩吧，实习一天也没有多少钱，等以后正式工作了，有钱也没有时间了，趁现在，多出去走走吧。感谢芳姐姐对我的支助，让我有机会去计划这次旅行。</p>\n<p>这一次，我是第一次一个人的旅行，我想在这炎热的夏天里，走出屋子，踏上行程。去坐一次轮渡、我还想再使用学生证享受一次学生特权、然后去看看海、去吹吹风、去看看更多的天空、去认识的人并说：“很高兴认识你”。也算是对整个大学青春岁月画上一个句号吧。<br>那接下来的一路上又会发生什么故事呢？</p>\n<p>最后以王小波的《黄金时代》结尾吧：<strong>那一天我二十一岁，在我一生的黄金时代，我有好多奢望。我想爱，想吃，还想在一瞬间变成天上半明半暗的云，后来我才知道，生活就是个缓慢受锤的过程，人一天天老下去，奢望也一天天消逝，最后变得像挨了锤的牛一样。可是我过二十一岁生日时没有预见到这一点。我觉得自己会永远生猛下去，什么也锤不了我。</strong></p>\n<p>我还年轻，我还可以到处走走，我还有很多想要去憧憬的、盼望的……</p>\n<p>—于2019.06.04 7:24 即将下班回家</p>\n","raw":"title: 写在我即将毕业旅行前\nauthor: 落叶挽歌\nthumbnail: 'https://cdn.pixabay.com/photo/2013/07/24/03/33/road-166543_960_720.jpg'\ntags:\n  - 旅行\ncategories:\n  - 生活感想\ndate: 2019-06-04 19:24:00\n---\n忙碌的一天，又要到下班的时候了，一天好似很忙，其实回过头来仔细想想，一天好像并没有做太多的事情，然而确实是这样子度过一天了，就像我们的青春岁月，看样子并没有经历什么，但它就这样匆匆过去了，亦忧伤，亦憧憬。\n\n还有两周就要回校参加毕业典礼了，向公司请了十天假，算上端午以及周末，大概有半个多月属于自己的日子吧，也算是大学最后一点还是以学生身份存在的时间了。早在几个月前我都在筹划这次出去游玩了，因为我想出去走走，想出去看看。纵观整个大学生涯，自己也算是去了不少地方了，屋子里车票、机票已经收纳了一沓了。看着每一张车票的起点与终点以及行程时间，还能想起那时候发生过的事，或许有些事还在记忆里面，或许可能存在我的日记里面，或许我什么也记不得了。\n\n**2015年8月15日 绵阳-上海：**距离大学开学还有一个月了，父亲陪我度过了整个高三，待我拿到通知书后，我与父亲来到上海。父亲是一个节俭的人，买了绿皮车，将近两千多公里的路程，三十多个小时的行程，脚没有办法舒展开，时间长了别的难受。当看到那些没有座位的那些人要不停地给过路人让路的时候，我觉得自己也挺幸运的，至少我还有一个属于自己的位置，不需要为别人让路。在这煎熬的行程中，我并没有去抱怨，我只是一直在想，我以后一定要努力，一定不会让我和我父亲再受这样的遭遇。\n\n**2015年9月14日 上海-温州**：马上就要大学开学了。离开了父母，将一个人去面对新的生活了，路过杭州的时候，车窗外一片开阔的平原，让我看到极具江南特色的景象：鳞次栉比的房屋伴着小河流，来来往往的车辆川流不息，很憧憬那样“小桥流水人家”的生活，这大概是对杭州的第一印象吧。\n\n**2016年1月22日 温州-成都：**大学寒假第一次回家，运气很好，我和同学抢到了卧铺票，有了一个较舒服的乘车环境。与我通行的还有很多大学川籍同学，因此一路上也变得并不孤独，时而和他们“摆龙门阵”，累了就回床铺上面去休息一下，我记得我当时带了一本《浪潮之巅》。\n\n**2017年7月18日 温州-太原：**第一次坐飞机，带着许多憧憬出发，但让人失望的是我错过了那一天的飞机，原本安排的好好的行程，一下子把我的计划打乱了。这时候我真的很迷茫，我不知道该去哪里，我也不知道该做什么，整个脑子是一片空白，在街上走走，最后回学校见到了精神支柱。然后去了太原平遥古城，喜欢太原老大爷那种街边悠然下着象棋的生活。\n\n**2017年7月10日 嘉兴-福州：**又是一次暑假，我去嘉兴看望我爸，然后我爸他们提议去福州找我的大姑爷家玩，这一次我和我的父亲快吵了一架，因为我想让他买一张动车票，可父亲执着的只买绿皮车票，他觉得能节约钱，可是我觉得时间才是最重要的，那时候我没有一点收入，我说服不了他，绿皮车从晚上八点开到第二天早上八点，整个一晚我没有怎么睡，感慨太多，我也告诉我自己要努力。当时也写过一篇随笔：[2017年710随笔 于嘉兴-福州列车](http://julis.wang/2017/07/10/2018%E5%B9%B4710%E9%9A%8F%E7%AC%94-%E4%BA%8E%E5%98%89%E5%85%B4-%E7%A6%8F%E5%B7%9E%E5%88%97%E8%BD%A6/ \"2017年710随笔 于嘉兴-福州列车\")\n\n**2017年9月02日 温州-杭州：**这一次算是第一次以异地恋的身份去见了那时喜欢的人，一路忐忑。记得那时候带的是一本《小王子》，但是感觉没有看太懂，好像过了天真的年纪，已经看不太明白小王子的天真了。\n\n**2018年8月23日 杭州-太原：** 或许真的是和太原有缘分，时隔一年再次去太原，这次我并没有错过，过了一年，变得成熟些了，这时候我已经在参加实习了。这次是代表整个学校唯一一只队伍进电子商务全国总决赛，压力与动力并存吧。\n\n**2019年2月14日 德阳-成都：**这是最近一次从家出发去杭州在成都中转，在德阳站中因为高铁晚点，我遇到了一个女孩子，或许这是读大学以后认识的第一个非本大学的四川女孩子吧，或许是缘分，我和她是同一辆车，在德阳到成都只有短短半个小时的行车时间，居然车晚点将近两个小时，于是和她就聊啊、聊啊，从小学说到初中高中，从高中说到大学，再从大学说到实习。原来她也和我一样是大四的学生，原来我和她大学同学是初中高中同学，真的是缘分吧。第一次是多么的希望列车晚点的时间能够再长一点。只可惜，我本将心照明月，奈何明月照沟渠。\n\n……\n\n**2019年6月10日 杭州-青岛、烟台、威海、大连？**  或许是在被公司同事的鼓励下：现在有时间多出去玩玩吧，实习一天也没有多少钱，等以后正式工作了，有钱也没有时间了，趁现在，多出去走走吧。感谢芳姐姐对我的支助，让我有机会去计划这次旅行。\n\n这一次，我是第一次一个人的旅行，我想在这炎热的夏天里，走出屋子，踏上行程。去坐一次轮渡、我还想再使用学生证享受一次学生特权、然后去看看海、去吹吹风、去看看更多的天空、去认识的人并说：“很高兴认识你”。也算是对整个大学青春岁月画上一个句号吧。\n那接下来的一路上又会发生什么故事呢？\n\n最后以王小波的《黄金时代》结尾吧：**那一天我二十一岁，在我一生的黄金时代，我有好多奢望。我想爱，想吃，还想在一瞬间变成天上半明半暗的云，后来我才知道，生活就是个缓慢受锤的过程，人一天天老下去，奢望也一天天消逝，最后变得像挨了锤的牛一样。可是我过二十一岁生日时没有预见到这一点。我觉得自己会永远生猛下去，什么也锤不了我。**\n\n我还年轻，我还可以到处走走，我还有很多想要去憧憬的、盼望的……\n\n\n--于2019.06.04 7:24 即将下班回家","categories":[{"name":"生活感想","api":"api/categories/life.json"}],"tags":[{"name":"旅行","api":"api/tags/travel.json"}]},"api":"api/posts/2019/06/04/写在毕业之际旅行前.json"}