{"data":{"index":1,"total":1,"posts":[{"title":"95后，毕业半年，你过得好吗？","slug":"95后的你们毕业半年过得还好么？","date":"2019-05-20T01:42:00.000Z","updated":"2025-05-20T11:46:57.000Z","comments":true,"url":"2019/05/20/95后的你们毕业半年过得还好么？/","excerpt":"<p>原帖：<a href=\"https://www.zhihu.com/question/307640916/answer/686748493\">https://www.zhihu.com/question/307640916/answer/686748493</a><br>95后，毕业半年，你过得好吗？<br>亲爱的95后，毕业两年，你过得怎么样了？充实或是空虚，甜蜜还是苦涩，热爱生活还是生无可恋，期待写下你的故事。</p>\n<p>96年 刚参加完学校的毕业答辩回来，离毕业也不远了吧。从去年暑假开始就在杭州实习了，最开始是做php后端，后来转到了安卓开发。实习了差不多快一年了，就要成“资深实习生”了。说实话我感觉我过得很充实吧，依然热爱生活。实习期间租房+伙食费+路费，如果不干别的什么事，一个月请假天数在两三天的话，每个月的生活是过得还算是比较舒服的，不太愁。实习之后就第一个月问家里要了一下房租和押金，以及驾校的学费。可以说完全独立了吧。拿到公司的offer是10几k，还是蛮期待拿毕业证转正的时候吧：<br>96年 刚参加完学校的毕业答辩回来，离毕业也不远了吧。从去年暑假开始就在杭州实习了，最开始是做php后端，后来转到了安卓开发。实习了差不多快一年了，就要成“资深实习生”了。说实话我感觉我过得很充实吧，依然热爱生活。实习期间租房+伙食费+路费，如果不干别的什么事，一个月请假天数在两三天的话，每个月的生活是过得还算是比较舒服的，不太愁。实习之后就第一个月问家里要了一下房租和押金，以及驾校的学费。可以说完全独立了吧。拿到公司的offer是10几k，还是蛮期待拿毕业证转正的时候吧。</p>\n<p>在这里我好想讲讲近一年的实习生活，过得日子也算是充满酸甜苦辣吧。从刚开始从公司实习开始讲吧：当时的我好像什么都会，php也会、python、java、安卓啥都会一样，经过被阿里面试打击后，可以看此帖子：<a href=\"https://www.zhihu.com/question/268713348/answer/352195054\">https://www.zhihu.com/question/268713348/answer/352195054</a></p>\n<p>我稍微收敛了一点了吧，最后进入了杭州一家互联网公司，刚开始是干php的，干了一个多月一点，感觉并没有学到多少东西，做的业务比较多，因为我属于“实习”的状态吧，安排的任务也比较少，所以每天的日子过得也很“悠闲”，每天干完就回家了，大概下午六点多就走了……这前面的php实习期间算是伏笔吧。之后由于刚好公司内部有个安卓实习的位置，好像是没有招到合适的吧，最开始面试的时候说了我什么都会，所以有幸被调到了安卓组里面。我发现好像每天的需求做起来还是那么简单，所以每天依然走得特别早吧，还有点沾沾自喜的样子，然而回到家并没有继续学习相关知识，要不就和女朋友（ broken up.）漫步钱塘江边，要么就是回到家里写写字看看其他类型的书，反正过得很舒服吧。</p>\n<p>直到有一天我被“伤自尊”了，一度自我感觉良好的我被组内的同事叫去看一个问题，我看了很久也看不出来，因为很多Java基础我都有些快忘了吧，基础不太扎实，我对代码的深度理解也有问题，我只停留在用的阶段，我不懂其原理，我只会使用，我连他们的源码都没有看过。</p>\n<p>后来被他鞭策道：你现在确实很厉害，比我当时刚出大学的时候厉害多了，但是我觉得我一点比你做的好，那就是我一直坚持在学习。你每天回去那么早没有学习，你在做什么？你现在对你自己的定位有些问题，现在你虽然觉得这些需求能做，但是你知道这些需求都是最简单的，工作难度都是最低的，我们为什么不把那些高难的任务给你？是因为你现在能力还不够，现在给你简单任务就是想让你多一些时间去学习，让你尽早能够跟上团队的步伐。实话给你说：你很菜！你真的很菜……你师傅可能不太好给你讲所以我才给你讲这些，如果你现在的状态，你永远只能做那些最简单的任务，可能连之后的校招offer都拿不到，就算侥幸8月份能拿到校招offer，也许你之后能侥幸转正，但是你不坚持学习的话迟早会被行业淘汰……</p>\n<p>这位前辈的话一直在我脑海里面印象深刻，我是一个不服输的人，在被鞭策后，我真的不服气，我也不认输，当时他叫我周末会去看一看”EventBus”的源码，然后周一向他汇报一下看的结果。周末连续两天都在看其源码，说实话看起来真的很痛苦，因为自己以前都是直接用，不会去关心它内部的逻辑，但是依然坚持看了两天，做了很多笔记，把它内部实现逻辑也搞明白了。忐忑不安地等到了周一，我向他汇报，我给他讲述了内部原理以及源码解读，他给我提了几个问题，我答上了一半多一点，我正沾沾自喜时，他给我说：如果给你这次评价满分一百分的话，我最多给你打20分。</p>\n<p>**！！！！20分，我的天！**我当时一下子整个人就不好了，甚至都想去反驳他了，可是他之后给我讲得东西，让我打消了这个念头，我确实菜。我确实认识到了自己的不足，对源代码的解读真的还不够，Java基础也不太扎实，包括我的师傅也这样认为，我是一个不服输的人，不服气。我向我师傅请教了，大概给自己定了一个短期的学习计划：先把Java基础过一遍，再过一遍Android基础过一把，再开始去理解安卓深度的东西。从此开始，我感觉我开始暴走了。</p>\n<p>我每天都背一两本书回去学习，在地铁上有时候位置空我也会拿出来继续学习，偶尔还是会找女朋友去玩，但是当我11点钟回到家，我还是会拿出书来继续学习。然后第二天我会和我的师傅讲我昨天学了什么，然后讲出我的疑问。我的师傅真的是一个很耐心的人，他会给我仔细地讲解，包括平时的问题，如果我向组内请教问：1+1等于几？ 他们会告诉我等于2。然而我的师傅会告诉我 加法口诀表，甚至是乘法口诀表。那时候我每天都不曾忘记学习，每天都会去研究，那一段时间我真的压力很大，经常性的失眠，心跳特别快，后面也去看过一次医生说是“心悸”。当然那也是在压力下人做出的一些极端反应，所幸的是我坚持了过来。八月中，HR把我叫了过去，我还以为她又要批判我了，因为最开始被团队的人给鞭策了之后，她也找过我谈话了：你如果还继续现在的状态，可能之后的校招offer都不会发给你。这一次不一样了，她给我讲了我转正后的待遇，什么期权还要公积金啥啥啥的，然后讲了工资多少多少，其实工资是有点超乎我预期的。她讲完之后，我真的笑了，真的开心了，我忍不住笑了起来。她问：开心吗？我一直点头。或许这是对努力之后最好的回报吧！那一刻真的，心里有太多说不出来，打心地的开心。</p>\n<p>拿到校招offer我还是坚持学习吧，只是强度没有之前那样强了，但是依然坚持每天要学习。现在我觉得每天每周过得生活都特别的充实吧，我们不是996。公司9点上班，弹性打卡9个小时，也就是说早上9点钟打卡，下午6点钟就可以走了，但是大部分人并不是6点钟走。现在自己每天早上都会比较期盼去公司，因为每次做需求，我都并不把他当做我的“工作”在做，而我认为那是我的兴趣爱好。我喜欢敲代码的感觉，我喜欢那种自己去设计思路想法，最后打磨出来产品的过程。而我们做出的成果会是被几百万用户所使用，肩上也有一种责任感吧。然后也带来了成就感，比如公司的宣传片或者展示公告大牌上面印着app的应用界面图，会看到里面有一部分是我做得，我是多么的开心呀。一次室友的朋友过来了，我们聊着天，后来聊到它妈妈也在用我们做得app，它给我说它妈妈怎么怎么这个App，我说啊，这里就是我做的呀。哇！厉害咯。我对工作保持乐观态度，因为我可以向厉害的前辈们请教问题，向他们学习，我每天都感觉自己有收获，所以在公司让我感觉过得很开心，没有太大的压力，每天都在进步。</p>\n<p>当然回到家了，我也有该做的事，我也有我的兴趣，大概每天7.30左右下班回家，回到家快8.30了。我也有自己追求，我在学日语，打算能在明年去一趟日本，感受一下不同的文化。日语学累了，我会继续学习相关专业的书籍，或者写写字，我比较喜欢写字，虽然没有很飘逸炫酷，但是我觉得写完之后看起来特别的舒服，这也算是一种成就感把，大概学到10.30收拾洗漱，大概11点左右上床了，我会继续看一些相关的书籍，比如最近在看《红楼梦》，厚厚的一本，渐渐地书签也跑到了中间的位置吧。</p>\n<p>至于周末，我可能比较放松吧，周末我会学着去做做菜，不再想吃外卖了，真的难吃且贵。</p>\n<p>有时候也会去绿城主场看看绿城踢球吧，虽然心里支持的四川队，但是远在他乡没有办法了。</p>\n<p>最后附上自己毕业答辩后拍的照片，算是对自己充实的大学生活的怀念吧。</p>\n<p>总之，我觉得自己每天都过得很充实吧，很热爱自己的生活。</p>\n<h2 id=\"愿每一个你们的生活都过得幸福。\"><a href=\"#愿每一个你们的生活都过得幸福。\" class=\"headerlink\" title=\"愿每一个你们的生活都过得幸福。\"></a>愿每一个你们的生活都过得幸福。</h2>","cover":null,"images":[],"content":"<p>原帖：<a href=\"https://www.zhihu.com/question/307640916/answer/686748493\">https://www.zhihu.com/question/307640916/answer/686748493</a><br>95后，毕业半年，你过得好吗？<br>亲爱的95后，毕业两年，你过得怎么样了？充实或是空虚，甜蜜还是苦涩，热爱生活还是生无可恋，期待写下你的故事。</p>\n<p>96年 刚参加完学校的毕业答辩回来，离毕业也不远了吧。从去年暑假开始就在杭州实习了，最开始是做php后端，后来转到了安卓开发。实习了差不多快一年了，就要成“资深实习生”了。说实话我感觉我过得很充实吧，依然热爱生活。实习期间租房+伙食费+路费，如果不干别的什么事，一个月请假天数在两三天的话，每个月的生活是过得还算是比较舒服的，不太愁。实习之后就第一个月问家里要了一下房租和押金，以及驾校的学费。可以说完全独立了吧。拿到公司的offer是10几k，还是蛮期待拿毕业证转正的时候吧：<br>96年 刚参加完学校的毕业答辩回来，离毕业也不远了吧。从去年暑假开始就在杭州实习了，最开始是做php后端，后来转到了安卓开发。实习了差不多快一年了，就要成“资深实习生”了。说实话我感觉我过得很充实吧，依然热爱生活。实习期间租房+伙食费+路费，如果不干别的什么事，一个月请假天数在两三天的话，每个月的生活是过得还算是比较舒服的，不太愁。实习之后就第一个月问家里要了一下房租和押金，以及驾校的学费。可以说完全独立了吧。拿到公司的offer是10几k，还是蛮期待拿毕业证转正的时候吧。</p>\n<p>在这里我好想讲讲近一年的实习生活，过得日子也算是充满酸甜苦辣吧。从刚开始从公司实习开始讲吧：当时的我好像什么都会，php也会、python、java、安卓啥都会一样，经过被阿里面试打击后，可以看此帖子：<a href=\"https://www.zhihu.com/question/268713348/answer/352195054\">https://www.zhihu.com/question/268713348/answer/352195054</a></p>\n<p>我稍微收敛了一点了吧，最后进入了杭州一家互联网公司，刚开始是干php的，干了一个多月一点，感觉并没有学到多少东西，做的业务比较多，因为我属于“实习”的状态吧，安排的任务也比较少，所以每天的日子过得也很“悠闲”，每天干完就回家了，大概下午六点多就走了……这前面的php实习期间算是伏笔吧。之后由于刚好公司内部有个安卓实习的位置，好像是没有招到合适的吧，最开始面试的时候说了我什么都会，所以有幸被调到了安卓组里面。我发现好像每天的需求做起来还是那么简单，所以每天依然走得特别早吧，还有点沾沾自喜的样子，然而回到家并没有继续学习相关知识，要不就和女朋友（ broken up.）漫步钱塘江边，要么就是回到家里写写字看看其他类型的书，反正过得很舒服吧。</p>\n<p>直到有一天我被“伤自尊”了，一度自我感觉良好的我被组内的同事叫去看一个问题，我看了很久也看不出来，因为很多Java基础我都有些快忘了吧，基础不太扎实，我对代码的深度理解也有问题，我只停留在用的阶段，我不懂其原理，我只会使用，我连他们的源码都没有看过。</p>\n<p>后来被他鞭策道：你现在确实很厉害，比我当时刚出大学的时候厉害多了，但是我觉得我一点比你做的好，那就是我一直坚持在学习。你每天回去那么早没有学习，你在做什么？你现在对你自己的定位有些问题，现在你虽然觉得这些需求能做，但是你知道这些需求都是最简单的，工作难度都是最低的，我们为什么不把那些高难的任务给你？是因为你现在能力还不够，现在给你简单任务就是想让你多一些时间去学习，让你尽早能够跟上团队的步伐。实话给你说：你很菜！你真的很菜……你师傅可能不太好给你讲所以我才给你讲这些，如果你现在的状态，你永远只能做那些最简单的任务，可能连之后的校招offer都拿不到，就算侥幸8月份能拿到校招offer，也许你之后能侥幸转正，但是你不坚持学习的话迟早会被行业淘汰……</p>\n<p>这位前辈的话一直在我脑海里面印象深刻，我是一个不服输的人，在被鞭策后，我真的不服气，我也不认输，当时他叫我周末会去看一看”EventBus”的源码，然后周一向他汇报一下看的结果。周末连续两天都在看其源码，说实话看起来真的很痛苦，因为自己以前都是直接用，不会去关心它内部的逻辑，但是依然坚持看了两天，做了很多笔记，把它内部实现逻辑也搞明白了。忐忑不安地等到了周一，我向他汇报，我给他讲述了内部原理以及源码解读，他给我提了几个问题，我答上了一半多一点，我正沾沾自喜时，他给我说：如果给你这次评价满分一百分的话，我最多给你打20分。</p>\n<p>**！！！！20分，我的天！**我当时一下子整个人就不好了，甚至都想去反驳他了，可是他之后给我讲得东西，让我打消了这个念头，我确实菜。我确实认识到了自己的不足，对源代码的解读真的还不够，Java基础也不太扎实，包括我的师傅也这样认为，我是一个不服输的人，不服气。我向我师傅请教了，大概给自己定了一个短期的学习计划：先把Java基础过一遍，再过一遍Android基础过一把，再开始去理解安卓深度的东西。从此开始，我感觉我开始暴走了。</p>\n<p>我每天都背一两本书回去学习，在地铁上有时候位置空我也会拿出来继续学习，偶尔还是会找女朋友去玩，但是当我11点钟回到家，我还是会拿出书来继续学习。然后第二天我会和我的师傅讲我昨天学了什么，然后讲出我的疑问。我的师傅真的是一个很耐心的人，他会给我仔细地讲解，包括平时的问题，如果我向组内请教问：1+1等于几？ 他们会告诉我等于2。然而我的师傅会告诉我 加法口诀表，甚至是乘法口诀表。那时候我每天都不曾忘记学习，每天都会去研究，那一段时间我真的压力很大，经常性的失眠，心跳特别快，后面也去看过一次医生说是“心悸”。当然那也是在压力下人做出的一些极端反应，所幸的是我坚持了过来。八月中，HR把我叫了过去，我还以为她又要批判我了，因为最开始被团队的人给鞭策了之后，她也找过我谈话了：你如果还继续现在的状态，可能之后的校招offer都不会发给你。这一次不一样了，她给我讲了我转正后的待遇，什么期权还要公积金啥啥啥的，然后讲了工资多少多少，其实工资是有点超乎我预期的。她讲完之后，我真的笑了，真的开心了，我忍不住笑了起来。她问：开心吗？我一直点头。或许这是对努力之后最好的回报吧！那一刻真的，心里有太多说不出来，打心地的开心。</p>\n<p>拿到校招offer我还是坚持学习吧，只是强度没有之前那样强了，但是依然坚持每天要学习。现在我觉得每天每周过得生活都特别的充实吧，我们不是996。公司9点上班，弹性打卡9个小时，也就是说早上9点钟打卡，下午6点钟就可以走了，但是大部分人并不是6点钟走。现在自己每天早上都会比较期盼去公司，因为每次做需求，我都并不把他当做我的“工作”在做，而我认为那是我的兴趣爱好。我喜欢敲代码的感觉，我喜欢那种自己去设计思路想法，最后打磨出来产品的过程。而我们做出的成果会是被几百万用户所使用，肩上也有一种责任感吧。然后也带来了成就感，比如公司的宣传片或者展示公告大牌上面印着app的应用界面图，会看到里面有一部分是我做得，我是多么的开心呀。一次室友的朋友过来了，我们聊着天，后来聊到它妈妈也在用我们做得app，它给我说它妈妈怎么怎么这个App，我说啊，这里就是我做的呀。哇！厉害咯。我对工作保持乐观态度，因为我可以向厉害的前辈们请教问题，向他们学习，我每天都感觉自己有收获，所以在公司让我感觉过得很开心，没有太大的压力，每天都在进步。</p>\n<p>当然回到家了，我也有该做的事，我也有我的兴趣，大概每天7.30左右下班回家，回到家快8.30了。我也有自己追求，我在学日语，打算能在明年去一趟日本，感受一下不同的文化。日语学累了，我会继续学习相关专业的书籍，或者写写字，我比较喜欢写字，虽然没有很飘逸炫酷，但是我觉得写完之后看起来特别的舒服，这也算是一种成就感把，大概学到10.30收拾洗漱，大概11点左右上床了，我会继续看一些相关的书籍，比如最近在看《红楼梦》，厚厚的一本，渐渐地书签也跑到了中间的位置吧。</p>\n<p>至于周末，我可能比较放松吧，周末我会学着去做做菜，不再想吃外卖了，真的难吃且贵。</p>\n<p>有时候也会去绿城主场看看绿城踢球吧，虽然心里支持的四川队，但是远在他乡没有办法了。</p>\n<p>最后附上自己毕业答辩后拍的照片，算是对自己充实的大学生活的怀念吧。</p>\n<p>总之，我觉得自己每天都过得很充实吧，很热爱自己的生活。</p>\n<h2 id=\"愿每一个你们的生活都过得幸福。\"><a href=\"#愿每一个你们的生活都过得幸福。\" class=\"headerlink\" title=\"愿每一个你们的生活都过得幸福。\"></a>愿每一个你们的生活都过得幸福。</h2>","categories":[{"name":"思考总结","slug":"thinking","api":"api/categories/thinking.json"}],"tags":[{"name":"知乎","slug":"zhihu","api":"api/tags/zhihu.json"}],"api":"api/posts/2019/05/20/95后的你们毕业半年过得还好么？.json"},{"title":"黑客可以厉害到什么程度？","slug":"黑客可以厉害到什么程度？","date":"2017-05-20T02:00:00.000Z","updated":"2025-05-20T11:46:57.000Z","comments":true,"url":"2017/05/20/黑客可以厉害到什么程度？/","excerpt":"<p>原帖发布于知乎:<a href=\"https://www.zhihu.com/question/264331588/answer/281676126\">《黑客可以厉害到什么程度？》</a></p>\n<h2 id=\"原文\"><a href=\"#原文\" class=\"headerlink\" title=\"原文\"></a>原文</h2><p>一个黑客很厉害，那一群黑客呢？<br>这里给大家讲下一个组织–中国红客联盟。<br>接下来给大家讲一下中国红客联盟的几次重大事件</p>\n<h3 id=\"第一次：-1998-年-5-月反击印尼网络\"><a href=\"#第一次：-1998-年-5-月反击印尼网络\" class=\"headerlink\" title=\"第一次： 1998 年 5 月反击印尼网络\"></a>第一次： 1998 年 5 月反击印尼网络</h3><p>原因：印度尼西亚发生动乱。在此期间，大批华人受到迫害，华人妇女遭到令人发指的强暴。<br><img src=\"https://pic2.zhimg.com/50/v2-daf1909a2585da271aba22845ca967e2_b.jpg\"></p>\n<p>1998 年 5 月，印度尼西亚发生动乱。在此期间，大批华人受到迫害，华人妇女遭到令人发指的强暴。至 7 、 8 月，事件真相才通过互联网陆续透漏出来。在国内新闻媒体不报道此事的情况下，中国网民通过互联网陆续获得了相关信息。 8 月初，全球华人社会形成抗议高潮， 8 月 7 日 ，世界各地华人更同步举行抗议示威。印尼暴徒的行为激怒了刚刚学会蹒跚走步的中国黑客们，他们不约而同聚集在聊天室（ IRC ）中，讨论并决定对向印尼网站攻击。这是中国黑客的第一次对外群体性攻击行动，其表现出的团结与协调成为今后类似攻击行动的典范。<br>8 月 7 日 ， ChinaByte 责任编辑在网站论坛中发现一个新帖。这一“帖子”声称中国黑客袭击了印尼站点，同时附上了尚未恢复原貌的站点网址。编辑印证后当即决定立即在每日发送给订户的新闻邮件中，首次增发“号外”。“号外”中只有简单两句话及一个网址，但包含了这一新闻事件的核心信息。全文为：“你的站点已被来自中国的‘黑客’所‘黑’，印尼的暴徒你们的暴行是会有报应的！！！（中文）’‘停止屠杀华人！！！’（英文）这是印尼一个‘ to kobudi.co.id ’的站点上日前出现的文字。这一站点目前被中国黑客小组所‘黑’。<br>这一“号外”几分钟里就发送到数万订户的邮箱中。 8 月 10 日 ， ChinaByte 更将相关新闻上了主页头条。标题赫然为：印尼排华暴行激怒中国黑客。副题为：网上怒潮连天起。<br>实际上，早在 8月7日之前，中国黑客已对印尼网站和电子邮箱展开攻击行动。他们通过破解密码而拥有了系统管理员的权利，将“苦难的同胞，我为你悲愤哭泣！”、“严惩暴徒！严惩凶手！血债血还！”等口号写在了印尼网站的首页上。他们同时还提供大量印尼重要部门的电子信箱，并向网友提供如何“轰炸”这些电子信箱的方法。 8 月 17 日 是印尼国庆日，这一天众多印尼网站再次遭到黑客的攻击，被黑网站首页都留有黑客们用不太连贯的英文以及中文声讨印尼排华暴行的词句。其中一名署名“ Warning From Chinese ”的黑客，在被黑的页面上留言道，他这样做只是提醒人们不要忘记５月间发生的惨案，此举并不会造成该 网站数据的丢失，但警告系统管理员必须将被黑页面保留 48 小时。这名黑客显然是为了让大家记住那场持续了 48 小时的排华暴乱。<br>中国黑客的攻击引起印尼政府强烈的反应，他们将中国民间黑客的行为指责为中国政府的怂恿，并指出是中国谋求地区霸权的强烈信号。据当时“美国之音” 8 月 9 日 报道，印尼一名政府官员今日抗议“中国黑客”的“暴行”，据他说在 8 月 7 日 以来，印尼至少有十余个互联网站，被自称“中国黑客”的组织摧毁，少数被贴上各种恐怖的图片，大部分被彻底破坏。另外 8 月 7 日 几乎所有的印尼政府公用邮箱均遭到了邮件炸弹的疯狂轰炸。该官员竟说：“我们希望中国人保持理智，因为前一阶段的事情是我们自己的事情！如果中国人不想分清华人和中国人的区别，那就说明中国是一个充满威胁的国家，中国不能把有华人的地方都看作他的领土。五十年代中国派来了军舰，我们可以理解，因为他们接走的是自己国家的人，今天中国黑客来了，我们迷惑，因为他们对我们自己的事情横加干涉。谁都知道，没有中国政府的授意，中国妇联是不会抗议的，中国政府不仅干涉我们的内政，而且挑唆国内黑客对我们的攻击。我们十分不满！” 8 月 11 日 ，印尼政府电子技术主管官员就中国黑客行为再度发言。他说：“虽然黑客攻击给印尼造成了很大的损失，但他表示对民间的激愤他表示理解。但，印尼的问题是否象宣传的那样严重，大可不必听信过于危言耸听的报道。印尼政府会把自己的问题处理好。在被问及黑客攻击的损失时，他说有上百个个网站被攻击，其中十几个被侵入，大部分遭到破坏，有黑客试图攻击金融系统，造成了一定损失。另外 8 月 7 日 当天，印尼的网络异常拥挤，当天的政府邮件系统几乎瘫痪，给印尼的正常社会秩序造成了一定影响。但这位发言人话题一转，再次耸人听闻地说道：“完全有把握说，中国的大量 ISP 凭借带宽的优势对我们进行了长达 30 个小时的邮件轰炸，我们很难说这不是有组织的行动。如果不是防空警报没响，我一定以为中国对我们宣战了。不过，谁的网络都有漏洞，任何民族都有黑客，我们不希望这是两个伟大民族仇恨的开端。我过去不相信中国威胁，现在我知道了不该听信中国政府口头上的什么政策，仅仅是他的十亿公民在政府偷偷怂恿下发泄一下不满，就是一种可怕的力量。”他最后说：“我敢打赌，黑客事件仅仅是中国人对他们地区称霸的一个信号，当他们踏上我们的国土，开始说三道四时，大家就会觉得‘中国威胁’多么贴切，东盟的朋友，应该首先记住！”</p>\n<h3 id=\"第二次：-1999-年-5-月反击美国网络\"><a href=\"#第二次：-1999-年-5-月反击美国网络\" class=\"headerlink\" title=\"第二次： 1999 年 5 月反击美国网络\"></a>第二次： 1999 年 5 月反击美国网络</h3><p>原因：以美国为首的北约空军用导弹袭击中国驻南联盟大使馆并造成三名中国记者死亡。<br><img src=\"https://pic4.zhimg.com/50/v2-82c3f8ed78a139607b074b4a64c4aa65_b.jpg\"></p>\n<p><img src=\"https://pic4.zhimg.com/50/v2-38ed004dec1e8439de7bcf35ff86c9ff_b.jpg\"></p>\n<p>1998年的牛刀小试为1999年的第一次中美黑客大战埋下伏笔。1999年美军误炸中国驻南使馆后，一大批网民开始思考要行动起来，大量只懂简单电脑知识的网民自学了一点黑客常识后便参与到了黑客大战中来(他们被蔑称为脚本小孩)，中国的人海战术正式形成。<br>1999年5月8日，以美国为首的北约悍然用5枚导弹袭击了我驻南斯拉夫联盟共和国大使馆，记者邵云环、许杏虎、朱颖遇难，另有20多人受伤。消息传来，国人震惊。<br>5月8日，“红客”们首次黑掉了美国驻华使馆的网页；<br>5月8日晚11点左右，“红客”们又成功突破白宫的防线，更改了白宫的主页；<br>5月10日，中国网民自发地在同一时间内向北约网站发出ping指令，北约服务器（<a href=\"http://www.nato.org)过载,一度瘫痪./\">http://www.nato.org）过载，一度瘫痪。</a><br>5.10日夜间，上述中国黑客网站攻击了<a href=\"http://www.capweb.net,一个美国国会的相关站点,并且用大约5分钟时间在上面公布了国外将近250个站点的密码,导致国外将近800多个站点被换上了全都自称是“中国黑客”的主页.到了北京时间12日白天,这些站点全部关闭./\">www.capweb.net，一个美国国会的相关站点，并且用大约5分钟时间在上面公布了国外将近250个站点的密码,导致国外将近800多个站点被换上了全都自称是“中国黑客”的主页。到了北京时间12日白天，这些站点全部关闭。</a><br>5月11日，成功侵入美国海军计算机与通讯华盛顿中心网站（<a href=\"http://www.nctsw.navy.mil).这是黑客攻击以来首次攻击美国军方站点./\">www.nctsw.navy.mil）。这是黑客攻击以来首次攻击美国军方站点。</a><br>5月17日，中国黑客紧急会议中心网站发出号召先致力于国内网络安全的改善，并着手为为国内大站义诊，以防止国外黑客对我国门户网站的攻击。<br>中国红客联盟、中国鹰派联盟、中国黑客联盟三大黑客组织成为这场中美黑客大战的主力军。一时间，红盟的lion、鹰派的万涛成为中国黑客英雄。<br>前者宣扬红客精神，给自己起了个独特的名字——“红客”(Honker)，希望以政治立场的正义性来证实自己攻击行为的合法性。<br>以文化或者爱国的名义，在1999年前后，一大批脚本小孩挑战黑客的进入门槛。那个时候，黑客技术就像今天的blog一样流行，中国城市街头的书摊上，到处可见匆忙印刷出来的黑客入门，五花八门的黑客杂志匆匆出炉。中国的网民听到关于黑客的传说，也许就是在这个时候。<br>1999年5月，即美国轰炸中国驻南联盟大使馆事件发生以后，当时中国的红客们袭击了美国的一些政府网站，包括能源部、内政部在内，这些网站的首页上一度高高飘扬着五星红旗。有一次大规模的攻击，还致使白宫的网站失灵三天。中国黑客攻击事件成了当时美国各大报纸的头条新闻</p>\n<h3 id=\"第三次：-1999-年-8-月反击台湾网络\"><a href=\"#第三次：-1999-年-8-月反击台湾网络\" class=\"headerlink\" title=\"第三次： 1999 年 8 月反击台湾网络\"></a>第三次： 1999 年 8 月反击台湾网络</h3><p>原因：1999 年 7 月 9 日 ， 李登辉在接受“德国之声”专访时，所提出了所谓“两国论”。</p>\n<p>1999 年 7 月 9 日 ，李登辉在接受“德国之声”专访时，所提出了所谓“两国论”。公然宣称，台湾当局将两岸关系定位在“国家与国家，至少是特殊的国与国的关系”。台湾当局有关负责人也随声附和，说两岸关系已从“两个对等政治实体”走到“两个国家”，两岸会谈就是“国与国的会谈”等等。台湾当局这些分裂祖国的言论将他们一贯蓄意分裂中国领土和主权、制造“两个中国”、“一中一台”、“台湾独立”的意图暴露无遗。“两国论”顿时导致两岸局势紧张。大陆黑客依靠刚刚对美网络攻击战中总结出的经验，从 8 月 7 日 开始攻击台湾十多个政府网站，台湾黑客随即于 8 月 8 日 展开反击，大陆黑客贴“世界上只有一个中国，世界只需要一个中国”，台湾黑客贴“台湾是中国永远分割的一部分”、“你们敢打，我们敢独；大陆黑客贴五星红旗，台湾黑客贴青天白日旗，一时间“山雨欲来风满楼”。香港、台湾报刊纷纷以“两岸黑客狂掀网络战”、“网络大战方兴未艾”、“网络开战：免不了的一场战争”为题，大肆进行报道：“台海两岸军队尚在隔海威吓，按兵观望，民间却已经先行拉开电脑资讯大战的序幕，双方电脑黑客互相攻击对方网站并张贴政治口号，展现实力。”<br>在大陆黑客的攻击中，台湾“行政院”、“国安局”、“新闻局”、“监察院”、“国民大会”等网站均被攻克。台湾方面指，仅对“国安局”的攻击 3 天内就达 7200 次。大陆黑客除删改网页外，还给许多台湾服务器安装了木马程序，导致不少网站服务器长时间瘫痪。值得一提的是，此次安装的木马程序由美国的 BO 首次改为了大陆黑客自己研发的“冰河”与 NetSpy ，而“木马冰河”也成了大陆黑客最为钟爱的木马程序。 8 月 11 日 ，台湾“国民大会”网站报警称，网站软、硬件疑遭黑客攻击造成严重毁损，即使是重灌系统也无法恢复。而警方对黑客仅利用软件就可破坏硬件，大感惊讶。在台湾黑客的第一波的反击下，铁道部、中国证监会、陕西科技信息网、浙江平阳国税局网站等篡改网页。随着两岸黑客对攻战规模的发展，大量的非政府网站开始被殃及。参与者非理性的成分越来越大，只要是“黑”下一个对方网站，就被视为胜利战果。这种情况是出于政治目的而实施的黑客攻击最普遍的现象，已超出少数真正意义上的黑客的行径。一直到八月底，两岸的黑客战才暂告一段。后来，台湾黑客扬言要在 十月一日 当天大举进攻大陆网站，而大陆黑客则针锋相对地表示，如果这样，将在是 十月十日 坚决反击。<br>中国大陆黑客与台湾黑客的互攻是一场“持久战”，但凡碰到刺激事件就会引发攻击。如 2000 年 3 月 18 日 台湾“大选”结束陈水扁上台的当晚，一些大陆黑客当即进行攻击行动。以下是名叫“天语”的一名黑客的自白：“本人天语，浙江人氏，现外出打工，月薪 800 元人民币，虽不穷困也不不富有，刚好穿暖吃饱，平民 - 草民 - 贱民一个，连正规的高中都还尚未读过！此次对台湾的几个站点页面修改纯属发自一时气愤！要分裂我中国，我想每一个中国人对这个观点上的态度和我都该是一样的！尔等现正对我中国站点进攻，昨天竟还有一个“可爱的”所谓的“黑客”竟对我的个人电脑挂带的 HTTPD 产生了兴趣。呵呵。。其 IP 来自 140.123.107.78 。在此想也不用本人来说尔等对我方的进攻之密集！本人现警告之！本人原已停止对台主机的破解，但听闻尔等竟然反攻，并破坏我国几个站点。本人忍耐有限，于昨晚进入尔等国防部的主机。本打算来个 deltree&#x2F;y c:\\ 但想此举必将引起黑客大战！顾及大家皆无利可图，本人最后退出 TELNET 进程并关闭端口，可能也顺手关了 80 端口 , （纯属水平太差！：））现公布屏捕图！望尔等也能息事宁人！！”正是这名“天语”和其他黑客攻陷了台湾“国防部”等多个网站。<br>2004 年台湾“大选”后，台湾情治部门透露， 3 · 20 “大选”刚结束不久，大陆黑客竟突破重重防火墙，侵入“总统府”和“国安会”内部网络系统，窃取并下载机密文件。近年来，台湾媒体屡屡报道“大陆网军入侵台湾”。两岸长期僵持的局面，决定了两岸黑客互相攻击的长期态势。 </p>\n<h3 id=\"第四次：-2000-年-1-2月反击日本网络\"><a href=\"#第四次：-2000-年-1-2月反击日本网络\" class=\"headerlink\" title=\"第四次： 2000 年 1~2月反击日本网络\"></a>第四次： 2000 年 1~2月反击日本网络</h3><p>原因：2000 年 1 月 21 日 ，日本最高法院无视历史事实，悍然判决参加过当年南京大屠杀的老兵东史郎见证大屠杀的诉讼败诉；<br><img src=\"https://pic4.zhimg.com/50/v2-98ac6f61ace587cce6ec8d608e978288_b.jpg\"></p>\n<p><img src=\"https://pic2.zhimg.com/50/v2-1954ec631342a0fe874cc29ad1bfded4_b.jpg\"></p>\n<p>由于日本厚颜否认南京大屠杀这一历史事实，从2000年1月24日下午，中国“红客”再次集体出击，先后有多个日本官方站点被入侵。1月24日5时45分日本科技厅网站被袭，主页上用英文写有“日本人是丧家之犬”，并与美国杂志《花花公子》链接，25日再次被攻入。<br>2000年年初，零星骚扰演变为一场争夺网站控制权的黑客战，有人称之为互联网上的“新抗日战争”。当年1月21日，日本最高法院驳回因揭露南京大屠杀而被告损害他人名誉的东史郎等人的上诉，并对其判处50万日元的罚款。两天后，日本右翼势力在大阪国际和平中心举行“二十世纪最大谎言——南京大屠杀彻底验证”集会，公然否认南京大屠杀的史实。<br>这两次事件直接引发了中国黑客对日本网站的大规模攻击，被替换的日本网页上，出现了“不肯正视历史真相的日本人是亚洲之耻”等抨击和谩骂的文字。<br>这次攻击中，一个自称“中国极右翼抗日联盟”的黑客组织最为抢眼。1月24日至2月13日，该组织对30多家日本政府机构及新闻网站发动攻击，包括科学技术厅、总务厅、每日新闻社、NHK等。<br>该组织还在网站上发布《致日本政府的公开信》，称其成员是“一切具有强烈爱国心的中国网虫”，宗旨是“对日本少数疯狗在网络里进行猛烈的打击”，并公布了300多个日本政府部门的网址、100多名日本议员的电子邮箱地址，以及十多种黑客攻击工具和网站攻击方法的说明。</p>\n<p>再补充一下：同年九月中国黑客进攻日本反动网站，纪念“九.一八”<br>2000年9月18日是一个特殊的日子，历史上的今天，是中华民族蒙受耻辱，永远无法忘却的日子。“九.一八”是国耻、国痛，但也是沈阳人、中国人的光荣，因为从这一天起一直到抗日战争的胜利，东北人民、中国人民同日本军国主义进行了不屈不挠的斗争。<br>就在这样一个特殊的日子里，中国的黑客再一次以自己的方式纪念“9.18”事变。昨晚19时31分，Chinaren新闻中心接到网友报料说有中国黑客于2000年9月18日下午19时30分左右成功地对日本的右翼反动网站<a href=\"http://www.since918.com.jp进行了攻击.向日本右翼表达了他们愤怒的声音./\">www.since918.com.jp进行了攻击。向日本右翼表达了他们愤怒的声音。</a><br>受到攻击的这个网站是臭名昭著的日本右翼反动派的大站点。该站点一直在狡辩和否认“9.18”事件，为日本军国主义招魂。此次中国黑客是使用DDOS方式黑掉了该网站，将整个信道堵住，从而无法登陆该网站。这是中国黑客为捍卫中国尊严，不忘“9.18”事件付诸的又一强有力的行动。此次攻击导致该网站系统瘫痪。所以无法访问到该主页。</p>\n<h3 id=\"第五次：-2001-年反击日本网络\"><a href=\"#第五次：-2001-年反击日本网络\" class=\"headerlink\" title=\"第五次： 2001 年反击日本网络\"></a>第五次： 2001 年反击日本网络</h3><p>原因：2001年前后，跨入新的世纪后之后，三菱车事件、日航事件、教科书事件、《台湾论》事件，令两国关系持续紧张，黑客攻击也趋于频繁。</p>\n<p>据日本政府官员称，2000年日本共发生63起以政治为目的的黑客攻击事件，而2001年，前五个月已发生650起。日本警方曾通过国际刑警机构向中国索取资料，以协助调查。<br>2001年8月13日，日本首相小泉纯一郎参拜靖国神社，中国黑客再次发动猛烈攻势。当日下午4时，日本气象厅网站服务器首先遭到攻击，主页被更改为带有英文字母和中文文字的页面。紧随其后，日本消防厅、防卫设施厅、通讯研究实验室，以及日本议员等网站相继沦陷，被贴上抗议文字及中国国旗。<br>在小泉参拜靖国神社后， 8 月的攻击波来得更为猛烈。中国的黑客在获悉新闻后，即刻采取行动，更换了部分日本政府站点的主页内容，以示抗议。中国黑客组织在声明中表示：小泉参拜靖国神社的举动严重伤害了亚洲各国人民尤其是中国人民的感情，加之此前的教科书事件等，令他们非常愤怒，为此，决定用攻击日本政府网站的方式，表达他们的强烈不满。其实，中国红客大联盟早已讨论，一旦 8 月 15 日 小泉参拜，将对日本网络采取何种攻击行动，没想到小泉提早参拜，因此红客大联盟成员也提前行动。<br>8 月 13 日 当天下午 4 时许，日本气象厅网站服务器首先受到中国黑客的攻击，其后，日本物质评估研究机构、日本战略物质研究中心、日本防御系统研究会、日本情报大会服务中心、日本消防厅、日本防卫设施厅、日本通讯研究实验室、日本议员网站等大批政府站点也受到攻击。 8 月 14 日 凌晨，红客大联盟发出了《对日本采取网络打击的声明》，内中写道：“日本首相小泉不顾全亚洲人民的抗议和日本国内祈求和平的声音，于昨日下午公然参拜了象征日本军国主义的靖国神社。日本领导人的这一错误举动严重地伤害了亚洲各国人民，尤其是受害最深的中国人民的感受。加之教科书事件等斑斑劣迹更是体现出日本当局对当年的错误毫无悔改之意。红客大联盟在得到此消息的的第一时间便召集了部分成员对此突发事件商讨对策。最终决定在我国政府还没有对日本提出抗议之前用我们所擅长的，表达我们网络时代青年一群对日本新政府的严正抗议和日本领导人的强烈不满。红客大联盟 (<a href=\"http://www.redhacker.org/\">www.RedHacker.org</a>) 在此次紧急行动中对以下的日本政府站点进行了主页替换。这和我们致力于推行的红客精神并不矛盾。红客大联盟对此件事情的发生表示遗憾，并将对以下所列举的受到的攻击的站点负责。历史不容忽视，事实岂能篡改，反击方能赢尊重，发展才是硬道理！” </p>\n<h3 id=\"第六次：-2001-年-4-月-5月反击-美国网络\"><a href=\"#第六次：-2001-年-4-月-5月反击-美国网络\" class=\"headerlink\" title=\"第六次： 2001 年 4 月~5月反击 美国网络\"></a>第六次： 2001 年 4 月~5月反击 美国网络</h3><p>原因：2001 年 4 月 1 日 ，美国军用侦察机将中国战机撞毁，导致飞行员王伟坠海死亡。</p>\n<p><img src=\"https://pic4.zhimg.com/50/v2-375b10c9ed9e68ea664523e6952c62df_b.jpg\"></p>\n<p>2001 年 4 月 1 日 ，美国军用侦察机将中国战机撞毁，导致飞行员王伟坠海死亡。这一事件在中国国内引起民众极大的愤慨，而在中美之间立刻造成布什新政府与中国关系紧张的局面。尽管 4 月 11 日 ，中国方面已同意美方机组人员先行返国，但事件尚未得到完全解决，两国间的气氛依旧剑拔弩张。从 4 月初开始，中美两国的黑客已经展开相互攻击。如美国黑客组织 poizonB0x 便是攻击中国网站的主力，而一个名为 pr0phet 的黑客则更是明确地说：“我一开始只是随机挑选一些网站作为攻击目标，不过现在我则主要攻击以 .edu.cn 和 ac.cn 结尾的网站，或者只是以 .cn 结尾的网站，都会成为我的攻击目标。”在这种气氛和情况下（ 5 月 8 日 又逢中国驻南使馆被炸两周年），中国黑客在 4 月 30 日 至 5 月 8 日 打响了大规模的“第六次卫国网络战”。对于这次中美黑客大战的“战绩”，不同媒体的报道有很大出入，据“中国红客联盟”负责人称，真正被攻破的美国网站到 5 月 7 日 为止有 1600 多个，其中主要的网站 ( 包括政府和军方的网站 ) 有 900 多个。而中国被攻破的网站有 1100 多个，主要网站有 600 多个。实际上，任何一次黑客战争既不可能事先公开“宣战”，更不可能有“终战”的截止日期。<br>这次中美黑客大战有以下特点：</p>\n<p>1 、中国黑客的攻击事出有因<br>在中国黑客的这次行动中，“中国红客网络安全技术联盟”（简称“中国红客联盟”， HUC ）是最瞩目的攻击主力，它使“红客”这一称谓再次叫响。其负责人 Lion 在 2000 年 12 月 1 日 就提出建议：“统一“红客”一词的英文名称（ honker ）。“红客”一词若能在英文中占有一席之地，这将具有非同寻常的意义！这样红客在世界范围内的交流与应用将变得更加方便；更重要的是，这样做能扩大影响力，增强凝聚力，促进红客文化的形成和进一步的发展！”也就是说中国黑客试图通过“红客”名称的确认，来赋予自己在一种特定情况下所作所为的正面形象。中国黑客涂改美国网页尽管也有以谩骂方式来泄愤，但主流是中国国旗、中国国歌和“伟大的中华民族万岁！”、“美国必须对撞机事件负完全责任”、“抗议美国向台湾出售武器，破坏世界和平！”等口号，实践着“维护祖国统一、捍卫国家主权、一致抵抗外辱、打击反华气焰”的行动宗旨。<br>2 、中国黑客的攻击具有群体规模<br>“中国红客联盟”、“中华黑客联盟”和“中国鹰派联盟”是攻击美国网站的主力，由于以往通过各种形式奠定的组织基础，因此得以在这次攻击行动中发挥群体力量，并带动了一大批临时参战的“菜鸟”（即技术生疏的新手）。如 4 月 30 日晚 7 点 ，“中国红客联盟”召开了“攻击美国网络动员大会”，并提供了更换美国网页的专用数据包；再如 5 月 4 日晚 ，中国黑客集中力量攻击白宫网站，据称参与人数有 8 万之众，事后白宫网站的新闻负责人吉米承认“大量数据同时涌入，堵塞了白宫与其互联网服务提供商的连接通道”。中国黑客万众一心的行动并且其间的出色协调，使得美国方面怀疑这次中国政府如果说没有背后支持，至少也是默许的。加拿大军事评论家、汉和情报评论高级分析员平可夫在香港《亚洲周刊》（第 19 期， 5 月 13 日 ）撰文称此次中国黑客的攻击为一场“新人民战争”，而这场战争的主体往往是可以称为“信息战网络战民兵”的庞大群体，武器是计算机、杀伤性火力构成是知识和技能，战场便是信息网络。<br>3 、中国黑客群体由年轻人组成<br>据媒体报道，“中国鹰派联盟”负责人老鹰今年 30 岁，而“中国红客联盟”负责人 lion 今年仅 21 岁，该组织发言人 bkbll 也年仅 21 岁，是在校大学生，其专业还不是计算机。 Bkbll 称“中国红客联盟”成员的平均年龄并不是媒体报道的 23 岁，而是更年轻，同时注册成员的 65% 是在校大学生。中国互联网信息中心（ CNNIC ）历次调查显示， 30 岁以下的青少年占全体网民的绝大多数。如最近一次调查显示（截止日期为 2000 年 12 月 31 日 ）， 8 个年龄段中， 18 至 24 岁占 41.18% ， 25 至 30 岁占 18.8% ， 18 岁以下占 14.93% ，也就是说， 18 至 30 岁年龄段的用户占到 2250 万总体的 75% 。今年中国网络用户预计将突破 3500 万， 2005 年将达到 2 亿，占全体国民的 15% 。从发展看，如此规模巨大的中国青年网络用户群体的网络行为，今后不论是对内还是对外，都将产生更大的效应。</p>\n<p>完～～<br>注：本文大部分内容来自  中国社会科学院新闻与传播研究所网络与数字传媒研究室主任闵大洪在博客中国于2005年02月12日 所发表的<a href=\"http://mdh.blogchina.com/64775.html\" title=\"《告别中国黑客的激情年代——写在“中国红客联盟”解散之际》\">《告别中国黑客的激情年代——写在“中国红客联盟”解散之际》</a>一文，本文中如有错误，欢迎指证。<br>推荐阅读：</p>\n","cover":null,"images":["https://pic2.zhimg.com/50/v2-daf1909a2585da271aba22845ca967e2_b.jpg","https://pic4.zhimg.com/50/v2-82c3f8ed78a139607b074b4a64c4aa65_b.jpg","https://pic4.zhimg.com/50/v2-38ed004dec1e8439de7bcf35ff86c9ff_b.jpg","https://pic4.zhimg.com/50/v2-98ac6f61ace587cce6ec8d608e978288_b.jpg","https://pic2.zhimg.com/50/v2-1954ec631342a0fe874cc29ad1bfded4_b.jpg","https://pic4.zhimg.com/50/v2-375b10c9ed9e68ea664523e6952c62df_b.jpg"],"content":"<p>原帖发布于知乎:<a href=\"https://www.zhihu.com/question/264331588/answer/281676126\">《黑客可以厉害到什么程度？》</a></p>\n<h2 id=\"原文\"><a href=\"#原文\" class=\"headerlink\" title=\"原文\"></a>原文</h2><p>一个黑客很厉害，那一群黑客呢？<br>这里给大家讲下一个组织–中国红客联盟。<br>接下来给大家讲一下中国红客联盟的几次重大事件</p>\n<h3 id=\"第一次：-1998-年-5-月反击印尼网络\"><a href=\"#第一次：-1998-年-5-月反击印尼网络\" class=\"headerlink\" title=\"第一次： 1998 年 5 月反击印尼网络\"></a>第一次： 1998 年 5 月反击印尼网络</h3><p>原因：印度尼西亚发生动乱。在此期间，大批华人受到迫害，华人妇女遭到令人发指的强暴。<br><img src=\"https://pic2.zhimg.com/50/v2-daf1909a2585da271aba22845ca967e2_b.jpg\"></p>\n<p>1998 年 5 月，印度尼西亚发生动乱。在此期间，大批华人受到迫害，华人妇女遭到令人发指的强暴。至 7 、 8 月，事件真相才通过互联网陆续透漏出来。在国内新闻媒体不报道此事的情况下，中国网民通过互联网陆续获得了相关信息。 8 月初，全球华人社会形成抗议高潮， 8 月 7 日 ，世界各地华人更同步举行抗议示威。印尼暴徒的行为激怒了刚刚学会蹒跚走步的中国黑客们，他们不约而同聚集在聊天室（ IRC ）中，讨论并决定对向印尼网站攻击。这是中国黑客的第一次对外群体性攻击行动，其表现出的团结与协调成为今后类似攻击行动的典范。<br>8 月 7 日 ， ChinaByte 责任编辑在网站论坛中发现一个新帖。这一“帖子”声称中国黑客袭击了印尼站点，同时附上了尚未恢复原貌的站点网址。编辑印证后当即决定立即在每日发送给订户的新闻邮件中，首次增发“号外”。“号外”中只有简单两句话及一个网址，但包含了这一新闻事件的核心信息。全文为：“你的站点已被来自中国的‘黑客’所‘黑’，印尼的暴徒你们的暴行是会有报应的！！！（中文）’‘停止屠杀华人！！！’（英文）这是印尼一个‘ to kobudi.co.id ’的站点上日前出现的文字。这一站点目前被中国黑客小组所‘黑’。<br>这一“号外”几分钟里就发送到数万订户的邮箱中。 8 月 10 日 ， ChinaByte 更将相关新闻上了主页头条。标题赫然为：印尼排华暴行激怒中国黑客。副题为：网上怒潮连天起。<br>实际上，早在 8月7日之前，中国黑客已对印尼网站和电子邮箱展开攻击行动。他们通过破解密码而拥有了系统管理员的权利，将“苦难的同胞，我为你悲愤哭泣！”、“严惩暴徒！严惩凶手！血债血还！”等口号写在了印尼网站的首页上。他们同时还提供大量印尼重要部门的电子信箱，并向网友提供如何“轰炸”这些电子信箱的方法。 8 月 17 日 是印尼国庆日，这一天众多印尼网站再次遭到黑客的攻击，被黑网站首页都留有黑客们用不太连贯的英文以及中文声讨印尼排华暴行的词句。其中一名署名“ Warning From Chinese ”的黑客，在被黑的页面上留言道，他这样做只是提醒人们不要忘记５月间发生的惨案，此举并不会造成该 网站数据的丢失，但警告系统管理员必须将被黑页面保留 48 小时。这名黑客显然是为了让大家记住那场持续了 48 小时的排华暴乱。<br>中国黑客的攻击引起印尼政府强烈的反应，他们将中国民间黑客的行为指责为中国政府的怂恿，并指出是中国谋求地区霸权的强烈信号。据当时“美国之音” 8 月 9 日 报道，印尼一名政府官员今日抗议“中国黑客”的“暴行”，据他说在 8 月 7 日 以来，印尼至少有十余个互联网站，被自称“中国黑客”的组织摧毁，少数被贴上各种恐怖的图片，大部分被彻底破坏。另外 8 月 7 日 几乎所有的印尼政府公用邮箱均遭到了邮件炸弹的疯狂轰炸。该官员竟说：“我们希望中国人保持理智，因为前一阶段的事情是我们自己的事情！如果中国人不想分清华人和中国人的区别，那就说明中国是一个充满威胁的国家，中国不能把有华人的地方都看作他的领土。五十年代中国派来了军舰，我们可以理解，因为他们接走的是自己国家的人，今天中国黑客来了，我们迷惑，因为他们对我们自己的事情横加干涉。谁都知道，没有中国政府的授意，中国妇联是不会抗议的，中国政府不仅干涉我们的内政，而且挑唆国内黑客对我们的攻击。我们十分不满！” 8 月 11 日 ，印尼政府电子技术主管官员就中国黑客行为再度发言。他说：“虽然黑客攻击给印尼造成了很大的损失，但他表示对民间的激愤他表示理解。但，印尼的问题是否象宣传的那样严重，大可不必听信过于危言耸听的报道。印尼政府会把自己的问题处理好。在被问及黑客攻击的损失时，他说有上百个个网站被攻击，其中十几个被侵入，大部分遭到破坏，有黑客试图攻击金融系统，造成了一定损失。另外 8 月 7 日 当天，印尼的网络异常拥挤，当天的政府邮件系统几乎瘫痪，给印尼的正常社会秩序造成了一定影响。但这位发言人话题一转，再次耸人听闻地说道：“完全有把握说，中国的大量 ISP 凭借带宽的优势对我们进行了长达 30 个小时的邮件轰炸，我们很难说这不是有组织的行动。如果不是防空警报没响，我一定以为中国对我们宣战了。不过，谁的网络都有漏洞，任何民族都有黑客，我们不希望这是两个伟大民族仇恨的开端。我过去不相信中国威胁，现在我知道了不该听信中国政府口头上的什么政策，仅仅是他的十亿公民在政府偷偷怂恿下发泄一下不满，就是一种可怕的力量。”他最后说：“我敢打赌，黑客事件仅仅是中国人对他们地区称霸的一个信号，当他们踏上我们的国土，开始说三道四时，大家就会觉得‘中国威胁’多么贴切，东盟的朋友，应该首先记住！”</p>\n<h3 id=\"第二次：-1999-年-5-月反击美国网络\"><a href=\"#第二次：-1999-年-5-月反击美国网络\" class=\"headerlink\" title=\"第二次： 1999 年 5 月反击美国网络\"></a>第二次： 1999 年 5 月反击美国网络</h3><p>原因：以美国为首的北约空军用导弹袭击中国驻南联盟大使馆并造成三名中国记者死亡。<br><img src=\"https://pic4.zhimg.com/50/v2-82c3f8ed78a139607b074b4a64c4aa65_b.jpg\"></p>\n<p><img src=\"https://pic4.zhimg.com/50/v2-38ed004dec1e8439de7bcf35ff86c9ff_b.jpg\"></p>\n<p>1998年的牛刀小试为1999年的第一次中美黑客大战埋下伏笔。1999年美军误炸中国驻南使馆后，一大批网民开始思考要行动起来，大量只懂简单电脑知识的网民自学了一点黑客常识后便参与到了黑客大战中来(他们被蔑称为脚本小孩)，中国的人海战术正式形成。<br>1999年5月8日，以美国为首的北约悍然用5枚导弹袭击了我驻南斯拉夫联盟共和国大使馆，记者邵云环、许杏虎、朱颖遇难，另有20多人受伤。消息传来，国人震惊。<br>5月8日，“红客”们首次黑掉了美国驻华使馆的网页；<br>5月8日晚11点左右，“红客”们又成功突破白宫的防线，更改了白宫的主页；<br>5月10日，中国网民自发地在同一时间内向北约网站发出ping指令，北约服务器（<a href=\"http://www.nato.org)过载,一度瘫痪./\">http://www.nato.org）过载，一度瘫痪。</a><br>5.10日夜间，上述中国黑客网站攻击了<a href=\"http://www.capweb.net,一个美国国会的相关站点,并且用大约5分钟时间在上面公布了国外将近250个站点的密码,导致国外将近800多个站点被换上了全都自称是“中国黑客”的主页.到了北京时间12日白天,这些站点全部关闭./\">www.capweb.net，一个美国国会的相关站点，并且用大约5分钟时间在上面公布了国外将近250个站点的密码,导致国外将近800多个站点被换上了全都自称是“中国黑客”的主页。到了北京时间12日白天，这些站点全部关闭。</a><br>5月11日，成功侵入美国海军计算机与通讯华盛顿中心网站（<a href=\"http://www.nctsw.navy.mil).这是黑客攻击以来首次攻击美国军方站点./\">www.nctsw.navy.mil）。这是黑客攻击以来首次攻击美国军方站点。</a><br>5月17日，中国黑客紧急会议中心网站发出号召先致力于国内网络安全的改善，并着手为为国内大站义诊，以防止国外黑客对我国门户网站的攻击。<br>中国红客联盟、中国鹰派联盟、中国黑客联盟三大黑客组织成为这场中美黑客大战的主力军。一时间，红盟的lion、鹰派的万涛成为中国黑客英雄。<br>前者宣扬红客精神，给自己起了个独特的名字——“红客”(Honker)，希望以政治立场的正义性来证实自己攻击行为的合法性。<br>以文化或者爱国的名义，在1999年前后，一大批脚本小孩挑战黑客的进入门槛。那个时候，黑客技术就像今天的blog一样流行，中国城市街头的书摊上，到处可见匆忙印刷出来的黑客入门，五花八门的黑客杂志匆匆出炉。中国的网民听到关于黑客的传说，也许就是在这个时候。<br>1999年5月，即美国轰炸中国驻南联盟大使馆事件发生以后，当时中国的红客们袭击了美国的一些政府网站，包括能源部、内政部在内，这些网站的首页上一度高高飘扬着五星红旗。有一次大规模的攻击，还致使白宫的网站失灵三天。中国黑客攻击事件成了当时美国各大报纸的头条新闻</p>\n<h3 id=\"第三次：-1999-年-8-月反击台湾网络\"><a href=\"#第三次：-1999-年-8-月反击台湾网络\" class=\"headerlink\" title=\"第三次： 1999 年 8 月反击台湾网络\"></a>第三次： 1999 年 8 月反击台湾网络</h3><p>原因：1999 年 7 月 9 日 ， 李登辉在接受“德国之声”专访时，所提出了所谓“两国论”。</p>\n<p>1999 年 7 月 9 日 ，李登辉在接受“德国之声”专访时，所提出了所谓“两国论”。公然宣称，台湾当局将两岸关系定位在“国家与国家，至少是特殊的国与国的关系”。台湾当局有关负责人也随声附和，说两岸关系已从“两个对等政治实体”走到“两个国家”，两岸会谈就是“国与国的会谈”等等。台湾当局这些分裂祖国的言论将他们一贯蓄意分裂中国领土和主权、制造“两个中国”、“一中一台”、“台湾独立”的意图暴露无遗。“两国论”顿时导致两岸局势紧张。大陆黑客依靠刚刚对美网络攻击战中总结出的经验，从 8 月 7 日 开始攻击台湾十多个政府网站，台湾黑客随即于 8 月 8 日 展开反击，大陆黑客贴“世界上只有一个中国，世界只需要一个中国”，台湾黑客贴“台湾是中国永远分割的一部分”、“你们敢打，我们敢独；大陆黑客贴五星红旗，台湾黑客贴青天白日旗，一时间“山雨欲来风满楼”。香港、台湾报刊纷纷以“两岸黑客狂掀网络战”、“网络大战方兴未艾”、“网络开战：免不了的一场战争”为题，大肆进行报道：“台海两岸军队尚在隔海威吓，按兵观望，民间却已经先行拉开电脑资讯大战的序幕，双方电脑黑客互相攻击对方网站并张贴政治口号，展现实力。”<br>在大陆黑客的攻击中，台湾“行政院”、“国安局”、“新闻局”、“监察院”、“国民大会”等网站均被攻克。台湾方面指，仅对“国安局”的攻击 3 天内就达 7200 次。大陆黑客除删改网页外，还给许多台湾服务器安装了木马程序，导致不少网站服务器长时间瘫痪。值得一提的是，此次安装的木马程序由美国的 BO 首次改为了大陆黑客自己研发的“冰河”与 NetSpy ，而“木马冰河”也成了大陆黑客最为钟爱的木马程序。 8 月 11 日 ，台湾“国民大会”网站报警称，网站软、硬件疑遭黑客攻击造成严重毁损，即使是重灌系统也无法恢复。而警方对黑客仅利用软件就可破坏硬件，大感惊讶。在台湾黑客的第一波的反击下，铁道部、中国证监会、陕西科技信息网、浙江平阳国税局网站等篡改网页。随着两岸黑客对攻战规模的发展，大量的非政府网站开始被殃及。参与者非理性的成分越来越大，只要是“黑”下一个对方网站，就被视为胜利战果。这种情况是出于政治目的而实施的黑客攻击最普遍的现象，已超出少数真正意义上的黑客的行径。一直到八月底，两岸的黑客战才暂告一段。后来，台湾黑客扬言要在 十月一日 当天大举进攻大陆网站，而大陆黑客则针锋相对地表示，如果这样，将在是 十月十日 坚决反击。<br>中国大陆黑客与台湾黑客的互攻是一场“持久战”，但凡碰到刺激事件就会引发攻击。如 2000 年 3 月 18 日 台湾“大选”结束陈水扁上台的当晚，一些大陆黑客当即进行攻击行动。以下是名叫“天语”的一名黑客的自白：“本人天语，浙江人氏，现外出打工，月薪 800 元人民币，虽不穷困也不不富有，刚好穿暖吃饱，平民 - 草民 - 贱民一个，连正规的高中都还尚未读过！此次对台湾的几个站点页面修改纯属发自一时气愤！要分裂我中国，我想每一个中国人对这个观点上的态度和我都该是一样的！尔等现正对我中国站点进攻，昨天竟还有一个“可爱的”所谓的“黑客”竟对我的个人电脑挂带的 HTTPD 产生了兴趣。呵呵。。其 IP 来自 140.123.107.78 。在此想也不用本人来说尔等对我方的进攻之密集！本人现警告之！本人原已停止对台主机的破解，但听闻尔等竟然反攻，并破坏我国几个站点。本人忍耐有限，于昨晚进入尔等国防部的主机。本打算来个 deltree&#x2F;y c:\\ 但想此举必将引起黑客大战！顾及大家皆无利可图，本人最后退出 TELNET 进程并关闭端口，可能也顺手关了 80 端口 , （纯属水平太差！：））现公布屏捕图！望尔等也能息事宁人！！”正是这名“天语”和其他黑客攻陷了台湾“国防部”等多个网站。<br>2004 年台湾“大选”后，台湾情治部门透露， 3 · 20 “大选”刚结束不久，大陆黑客竟突破重重防火墙，侵入“总统府”和“国安会”内部网络系统，窃取并下载机密文件。近年来，台湾媒体屡屡报道“大陆网军入侵台湾”。两岸长期僵持的局面，决定了两岸黑客互相攻击的长期态势。 </p>\n<h3 id=\"第四次：-2000-年-1-2月反击日本网络\"><a href=\"#第四次：-2000-年-1-2月反击日本网络\" class=\"headerlink\" title=\"第四次： 2000 年 1~2月反击日本网络\"></a>第四次： 2000 年 1~2月反击日本网络</h3><p>原因：2000 年 1 月 21 日 ，日本最高法院无视历史事实，悍然判决参加过当年南京大屠杀的老兵东史郎见证大屠杀的诉讼败诉；<br><img src=\"https://pic4.zhimg.com/50/v2-98ac6f61ace587cce6ec8d608e978288_b.jpg\"></p>\n<p><img src=\"https://pic2.zhimg.com/50/v2-1954ec631342a0fe874cc29ad1bfded4_b.jpg\"></p>\n<p>由于日本厚颜否认南京大屠杀这一历史事实，从2000年1月24日下午，中国“红客”再次集体出击，先后有多个日本官方站点被入侵。1月24日5时45分日本科技厅网站被袭，主页上用英文写有“日本人是丧家之犬”，并与美国杂志《花花公子》链接，25日再次被攻入。<br>2000年年初，零星骚扰演变为一场争夺网站控制权的黑客战，有人称之为互联网上的“新抗日战争”。当年1月21日，日本最高法院驳回因揭露南京大屠杀而被告损害他人名誉的东史郎等人的上诉，并对其判处50万日元的罚款。两天后，日本右翼势力在大阪国际和平中心举行“二十世纪最大谎言——南京大屠杀彻底验证”集会，公然否认南京大屠杀的史实。<br>这两次事件直接引发了中国黑客对日本网站的大规模攻击，被替换的日本网页上，出现了“不肯正视历史真相的日本人是亚洲之耻”等抨击和谩骂的文字。<br>这次攻击中，一个自称“中国极右翼抗日联盟”的黑客组织最为抢眼。1月24日至2月13日，该组织对30多家日本政府机构及新闻网站发动攻击，包括科学技术厅、总务厅、每日新闻社、NHK等。<br>该组织还在网站上发布《致日本政府的公开信》，称其成员是“一切具有强烈爱国心的中国网虫”，宗旨是“对日本少数疯狗在网络里进行猛烈的打击”，并公布了300多个日本政府部门的网址、100多名日本议员的电子邮箱地址，以及十多种黑客攻击工具和网站攻击方法的说明。</p>\n<p>再补充一下：同年九月中国黑客进攻日本反动网站，纪念“九.一八”<br>2000年9月18日是一个特殊的日子，历史上的今天，是中华民族蒙受耻辱，永远无法忘却的日子。“九.一八”是国耻、国痛，但也是沈阳人、中国人的光荣，因为从这一天起一直到抗日战争的胜利，东北人民、中国人民同日本军国主义进行了不屈不挠的斗争。<br>就在这样一个特殊的日子里，中国的黑客再一次以自己的方式纪念“9.18”事变。昨晚19时31分，Chinaren新闻中心接到网友报料说有中国黑客于2000年9月18日下午19时30分左右成功地对日本的右翼反动网站<a href=\"http://www.since918.com.jp进行了攻击.向日本右翼表达了他们愤怒的声音./\">www.since918.com.jp进行了攻击。向日本右翼表达了他们愤怒的声音。</a><br>受到攻击的这个网站是臭名昭著的日本右翼反动派的大站点。该站点一直在狡辩和否认“9.18”事件，为日本军国主义招魂。此次中国黑客是使用DDOS方式黑掉了该网站，将整个信道堵住，从而无法登陆该网站。这是中国黑客为捍卫中国尊严，不忘“9.18”事件付诸的又一强有力的行动。此次攻击导致该网站系统瘫痪。所以无法访问到该主页。</p>\n<h3 id=\"第五次：-2001-年反击日本网络\"><a href=\"#第五次：-2001-年反击日本网络\" class=\"headerlink\" title=\"第五次： 2001 年反击日本网络\"></a>第五次： 2001 年反击日本网络</h3><p>原因：2001年前后，跨入新的世纪后之后，三菱车事件、日航事件、教科书事件、《台湾论》事件，令两国关系持续紧张，黑客攻击也趋于频繁。</p>\n<p>据日本政府官员称，2000年日本共发生63起以政治为目的的黑客攻击事件，而2001年，前五个月已发生650起。日本警方曾通过国际刑警机构向中国索取资料，以协助调查。<br>2001年8月13日，日本首相小泉纯一郎参拜靖国神社，中国黑客再次发动猛烈攻势。当日下午4时，日本气象厅网站服务器首先遭到攻击，主页被更改为带有英文字母和中文文字的页面。紧随其后，日本消防厅、防卫设施厅、通讯研究实验室，以及日本议员等网站相继沦陷，被贴上抗议文字及中国国旗。<br>在小泉参拜靖国神社后， 8 月的攻击波来得更为猛烈。中国的黑客在获悉新闻后，即刻采取行动，更换了部分日本政府站点的主页内容，以示抗议。中国黑客组织在声明中表示：小泉参拜靖国神社的举动严重伤害了亚洲各国人民尤其是中国人民的感情，加之此前的教科书事件等，令他们非常愤怒，为此，决定用攻击日本政府网站的方式，表达他们的强烈不满。其实，中国红客大联盟早已讨论，一旦 8 月 15 日 小泉参拜，将对日本网络采取何种攻击行动，没想到小泉提早参拜，因此红客大联盟成员也提前行动。<br>8 月 13 日 当天下午 4 时许，日本气象厅网站服务器首先受到中国黑客的攻击，其后，日本物质评估研究机构、日本战略物质研究中心、日本防御系统研究会、日本情报大会服务中心、日本消防厅、日本防卫设施厅、日本通讯研究实验室、日本议员网站等大批政府站点也受到攻击。 8 月 14 日 凌晨，红客大联盟发出了《对日本采取网络打击的声明》，内中写道：“日本首相小泉不顾全亚洲人民的抗议和日本国内祈求和平的声音，于昨日下午公然参拜了象征日本军国主义的靖国神社。日本领导人的这一错误举动严重地伤害了亚洲各国人民，尤其是受害最深的中国人民的感受。加之教科书事件等斑斑劣迹更是体现出日本当局对当年的错误毫无悔改之意。红客大联盟在得到此消息的的第一时间便召集了部分成员对此突发事件商讨对策。最终决定在我国政府还没有对日本提出抗议之前用我们所擅长的，表达我们网络时代青年一群对日本新政府的严正抗议和日本领导人的强烈不满。红客大联盟 (<a href=\"http://www.redhacker.org/\">www.RedHacker.org</a>) 在此次紧急行动中对以下的日本政府站点进行了主页替换。这和我们致力于推行的红客精神并不矛盾。红客大联盟对此件事情的发生表示遗憾，并将对以下所列举的受到的攻击的站点负责。历史不容忽视，事实岂能篡改，反击方能赢尊重，发展才是硬道理！” </p>\n<h3 id=\"第六次：-2001-年-4-月-5月反击-美国网络\"><a href=\"#第六次：-2001-年-4-月-5月反击-美国网络\" class=\"headerlink\" title=\"第六次： 2001 年 4 月~5月反击 美国网络\"></a>第六次： 2001 年 4 月~5月反击 美国网络</h3><p>原因：2001 年 4 月 1 日 ，美国军用侦察机将中国战机撞毁，导致飞行员王伟坠海死亡。</p>\n<p><img src=\"https://pic4.zhimg.com/50/v2-375b10c9ed9e68ea664523e6952c62df_b.jpg\"></p>\n<p>2001 年 4 月 1 日 ，美国军用侦察机将中国战机撞毁，导致飞行员王伟坠海死亡。这一事件在中国国内引起民众极大的愤慨，而在中美之间立刻造成布什新政府与中国关系紧张的局面。尽管 4 月 11 日 ，中国方面已同意美方机组人员先行返国，但事件尚未得到完全解决，两国间的气氛依旧剑拔弩张。从 4 月初开始，中美两国的黑客已经展开相互攻击。如美国黑客组织 poizonB0x 便是攻击中国网站的主力，而一个名为 pr0phet 的黑客则更是明确地说：“我一开始只是随机挑选一些网站作为攻击目标，不过现在我则主要攻击以 .edu.cn 和 ac.cn 结尾的网站，或者只是以 .cn 结尾的网站，都会成为我的攻击目标。”在这种气氛和情况下（ 5 月 8 日 又逢中国驻南使馆被炸两周年），中国黑客在 4 月 30 日 至 5 月 8 日 打响了大规模的“第六次卫国网络战”。对于这次中美黑客大战的“战绩”，不同媒体的报道有很大出入，据“中国红客联盟”负责人称，真正被攻破的美国网站到 5 月 7 日 为止有 1600 多个，其中主要的网站 ( 包括政府和军方的网站 ) 有 900 多个。而中国被攻破的网站有 1100 多个，主要网站有 600 多个。实际上，任何一次黑客战争既不可能事先公开“宣战”，更不可能有“终战”的截止日期。<br>这次中美黑客大战有以下特点：</p>\n<p>1 、中国黑客的攻击事出有因<br>在中国黑客的这次行动中，“中国红客网络安全技术联盟”（简称“中国红客联盟”， HUC ）是最瞩目的攻击主力，它使“红客”这一称谓再次叫响。其负责人 Lion 在 2000 年 12 月 1 日 就提出建议：“统一“红客”一词的英文名称（ honker ）。“红客”一词若能在英文中占有一席之地，这将具有非同寻常的意义！这样红客在世界范围内的交流与应用将变得更加方便；更重要的是，这样做能扩大影响力，增强凝聚力，促进红客文化的形成和进一步的发展！”也就是说中国黑客试图通过“红客”名称的确认，来赋予自己在一种特定情况下所作所为的正面形象。中国黑客涂改美国网页尽管也有以谩骂方式来泄愤，但主流是中国国旗、中国国歌和“伟大的中华民族万岁！”、“美国必须对撞机事件负完全责任”、“抗议美国向台湾出售武器，破坏世界和平！”等口号，实践着“维护祖国统一、捍卫国家主权、一致抵抗外辱、打击反华气焰”的行动宗旨。<br>2 、中国黑客的攻击具有群体规模<br>“中国红客联盟”、“中华黑客联盟”和“中国鹰派联盟”是攻击美国网站的主力，由于以往通过各种形式奠定的组织基础，因此得以在这次攻击行动中发挥群体力量，并带动了一大批临时参战的“菜鸟”（即技术生疏的新手）。如 4 月 30 日晚 7 点 ，“中国红客联盟”召开了“攻击美国网络动员大会”，并提供了更换美国网页的专用数据包；再如 5 月 4 日晚 ，中国黑客集中力量攻击白宫网站，据称参与人数有 8 万之众，事后白宫网站的新闻负责人吉米承认“大量数据同时涌入，堵塞了白宫与其互联网服务提供商的连接通道”。中国黑客万众一心的行动并且其间的出色协调，使得美国方面怀疑这次中国政府如果说没有背后支持，至少也是默许的。加拿大军事评论家、汉和情报评论高级分析员平可夫在香港《亚洲周刊》（第 19 期， 5 月 13 日 ）撰文称此次中国黑客的攻击为一场“新人民战争”，而这场战争的主体往往是可以称为“信息战网络战民兵”的庞大群体，武器是计算机、杀伤性火力构成是知识和技能，战场便是信息网络。<br>3 、中国黑客群体由年轻人组成<br>据媒体报道，“中国鹰派联盟”负责人老鹰今年 30 岁，而“中国红客联盟”负责人 lion 今年仅 21 岁，该组织发言人 bkbll 也年仅 21 岁，是在校大学生，其专业还不是计算机。 Bkbll 称“中国红客联盟”成员的平均年龄并不是媒体报道的 23 岁，而是更年轻，同时注册成员的 65% 是在校大学生。中国互联网信息中心（ CNNIC ）历次调查显示， 30 岁以下的青少年占全体网民的绝大多数。如最近一次调查显示（截止日期为 2000 年 12 月 31 日 ）， 8 个年龄段中， 18 至 24 岁占 41.18% ， 25 至 30 岁占 18.8% ， 18 岁以下占 14.93% ，也就是说， 18 至 30 岁年龄段的用户占到 2250 万总体的 75% 。今年中国网络用户预计将突破 3500 万， 2005 年将达到 2 亿，占全体国民的 15% 。从发展看，如此规模巨大的中国青年网络用户群体的网络行为，今后不论是对内还是对外，都将产生更大的效应。</p>\n<p>完～～<br>注：本文大部分内容来自  中国社会科学院新闻与传播研究所网络与数字传媒研究室主任闵大洪在博客中国于2005年02月12日 所发表的<a href=\"http://mdh.blogchina.com/64775.html\" title=\"《告别中国黑客的激情年代——写在“中国红客联盟”解散之际》\">《告别中国黑客的激情年代——写在“中国红客联盟”解散之际》</a>一文，本文中如有错误，欢迎指证。<br>推荐阅读：</p>\n","categories":[{"name":"思考总结","slug":"thinking","api":"api/categories/thinking.json"}],"tags":[{"name":"知乎","slug":"zhihu","api":"api/tags/zhihu.json"}],"api":"api/posts/2017/05/20/黑客可以厉害到什么程度？.json"}],"info":{"type":"tag","name":"知乎","slug":"zhihu"}},"api":"api/tags/zhihu/page.1.json"}